-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2.1
-- http://www.phpmyadmin.net
--
-- 主機: localhost
-- 產生時間： 2022 年 06 月 21 日 20:03
-- 伺服器版本: 5.7.33-0ubuntu0.16.04.1
-- PHP 版本： 7.0.33-0ubuntu0.16.04.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `A1093325`
--

-- --------------------------------------------------------

--
-- 資料表結構 `aarea`
--

CREATE TABLE `aarea` (
  `id` int(11) NOT NULL,
  `town` varchar(20) NOT NULL,
  `district` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 資料表的匯出資料 `aarea`
--

INSERT INTO `aarea` (`id`, `town`, `district`) VALUES
(100, '臺北市', '中正區'),
(103, '臺北市', '大同區'),
(104, '臺北市', '中山區'),
(105, '臺北市', '松山區'),
(106, '臺北市', '大安區'),
(108, '臺北市', '萬華區'),
(110, '臺北市', '信義區'),
(111, '臺北市', '士林區'),
(112, '臺北市', '北投區'),
(114, '臺北市', '內湖區'),
(115, '臺北市', '南港區'),
(116, '臺北市', '文山區'),
(200, '基隆市', '仁愛區'),
(201, '基隆市', '信義區'),
(202, '基隆市', '中正區'),
(203, '基隆市', '中山區'),
(204, '基隆市', '安樂區'),
(205, '基隆市', '暖暖區'),
(206, '基隆市', '七堵區'),
(207, '新北市', '萬里區'),
(208, '新北市', '金山區'),
(220, '新北市', '板橋區'),
(221, '新北市', '汐止區'),
(222, '新北市', '深坑區'),
(223, '新北市', '石碇區'),
(224, '新北市', '瑞芳區'),
(226, '新北市', '平溪區'),
(227, '新北市', '雙溪區'),
(228, '新北市', '貢寮區'),
(231, '新北市', '新店區'),
(232, '新北市', '坪林區'),
(233, '新北市', '烏來區'),
(234, '新北市', '永和區'),
(235, '新北市', '中和區'),
(236, '新北市', '土城區'),
(237, '新北市', '三峽區'),
(238, '新北市', '樹林區'),
(239, '新北市', '鶯歌區'),
(241, '新北市', '三重區'),
(242, '新北市', '新莊區'),
(243, '新北市', '泰山區'),
(244, '新北市', '林口區'),
(247, '新北市', '蘆洲區'),
(248, '新北市', '五股區'),
(249, '新北市', '八里區'),
(251, '新北市', '淡水區'),
(252, '新北市', '三芝區'),
(253, '新北市', '石門區'),
(260, '宜蘭縣', '宜蘭市'),
(261, '宜蘭縣', '頭城鎮'),
(262, '宜蘭縣', '礁溪鄉'),
(263, '宜蘭縣', '壯圍鄉'),
(264, '宜蘭縣', '員山鄉'),
(265, '宜蘭縣', '羅東鎮'),
(266, '宜蘭縣', '三星鄉'),
(267, '宜蘭縣', '大同鄉'),
(268, '宜蘭縣', '五結鄉'),
(269, '宜蘭縣', '冬山鄉'),
(270, '宜蘭縣', '蘇澳鎮'),
(272, '宜蘭縣', '南澳鄉'),
(302, '新竹縣', '竹北市'),
(303, '新竹縣', '湖口鄉'),
(304, '新竹縣', '新豐鄉'),
(305, '新竹縣', '新埔鎮'),
(306, '新竹縣', '關西鎮'),
(307, '新竹縣', '芎林鄉'),
(308, '新竹縣', '賽山鄉'),
(310, '新竹縣', '竹東鎮'),
(311, '新竹縣', '五峰鄉'),
(312, '新竹縣', '橫山鄉'),
(313, '新竹縣', '尖石鄉'),
(314, '新竹縣', '北埔鄉'),
(315, '新竹縣', '峨眉鄉'),
(320, '桃園縣', '中壢區'),
(324, '桃園縣', '平鎮區'),
(325, '桃園縣', '龍潭區'),
(326, '桃園縣', '楊梅區'),
(327, '桃園縣', '新屋區'),
(328, '桃園縣', '觀音區'),
(330, '桃園縣', '桃園區'),
(333, '桃園縣', '龜山區'),
(334, '桃園縣', '八德區'),
(335, '桃園縣', '大溪區'),
(336, '桃園縣', '復興區'),
(337, '桃園縣', '大園區'),
(338, '桃園縣', '蘆竹區'),
(350, '苗栗縣', '竹南鎮'),
(351, '苗栗縣', '頭份市'),
(352, '苗栗縣', '三灣鄉'),
(353, '苗栗縣', '南庄鄉'),
(354, '苗栗縣', '獅潭鄉'),
(356, '苗栗縣', '後龍鎮'),
(357, '苗栗縣', '通霄鎮'),
(358, '苗栗縣', '苑裡鎮'),
(360, '苗栗縣', '苗栗市'),
(361, '苗栗縣', '造橋鄉'),
(362, '苗栗縣', '頭屋鄉'),
(363, '苗栗縣', '公館鄉'),
(364, '苗栗縣', '大湖鄉'),
(365, '苗栗縣', '泰安鄉'),
(366, '苗栗縣', '銅鑼鄉'),
(367, '苗栗縣', '三義鄉'),
(368, '苗栗縣', '西湖鄉'),
(369, '苗栗縣', '卓蘭鎮'),
(400, '臺中市', '中區'),
(401, '臺中市', '東區'),
(402, '臺中市', '南區'),
(403, '臺中市', '西區'),
(404, '臺中市', '北區'),
(406, '臺中市', '北屯區'),
(407, '臺中市', '西屯區'),
(408, '臺中市', '南屯區'),
(411, '臺中市', '太平區'),
(412, '臺中市', '大里區'),
(413, '臺中市', '霧峰區'),
(414, '臺中市', '烏日區'),
(420, '臺中市', '豐原區'),
(421, '臺中市', '后里區'),
(422, '臺中市', '石岡區'),
(423, '臺中市', '東勢區'),
(424, '臺中市', '和平區'),
(426, '臺中市', '新社區'),
(427, '臺中市', '潭子區'),
(428, '臺中市', '大雅區'),
(429, '臺中市', '神岡區'),
(432, '臺中市', '大肚區'),
(433, '臺中市', '沙鹿區'),
(434, '臺中市', '龍井區'),
(435, '臺中市', '梧棲區'),
(436, '臺中市', '清水區'),
(437, '臺中市', '大甲區'),
(438, '臺中市', '外埔區'),
(439, '臺中市', '大安區'),
(500, '彰化縣', '彰化市'),
(502, '彰化縣', '芬園鄉'),
(503, '彰化縣', '花壇鄉'),
(504, '彰化縣', '秀水鄉'),
(505, '彰化縣', '鹿港鎮'),
(506, '彰化縣', '福興鄉'),
(507, '彰化縣', '線西鄉'),
(508, '彰化縣', '和美鎮'),
(509, '彰化縣', '伸港鄉'),
(510, '彰化縣', '員林市'),
(511, '彰化縣', '社頭鄉'),
(512, '彰化縣', '永靖鄉'),
(513, '彰化縣', '埔心鄉'),
(514, '彰化縣', '溪湖鎮'),
(515, '彰化縣', '大村鄉'),
(516, '彰化縣', '埔鹽鄉'),
(520, '彰化縣', '田中鎮'),
(521, '彰化縣', '北斗鎮'),
(522, '彰化縣', '田尾鄉'),
(523, '彰化縣', '埤頭鄉'),
(524, '彰化縣', '溪州鄉'),
(525, '彰化縣', '竹塘鄉'),
(526, '彰化縣', '二林鎮'),
(527, '彰化縣', '大城鄉'),
(528, '彰化縣', '芳苑鄉'),
(530, '彰化縣', '二水鄉'),
(540, '南投縣', '南投市'),
(541, '南投縣', '中寮鄉'),
(542, '南投縣', '草屯鎮'),
(544, '南投縣', '國姓鄉'),
(545, '南投縣', '埔里鎮'),
(546, '南投縣', '仁愛鄉'),
(551, '南投縣', '名間鄉'),
(552, '南投縣', '集集鎮'),
(553, '南投縣', '水里鄉'),
(555, '南投縣', '魚池鄉'),
(556, '南投縣', '信義鄉'),
(557, '南投縣', '竹山鎮'),
(558, '南投縣', '鹿谷鄉'),
(602, '嘉義縣', '番路鄉'),
(603, '嘉義縣', '梅山鄉'),
(604, '嘉義縣', '竹崎鄉'),
(605, '嘉義縣', '阿里山鄉'),
(606, '嘉義縣', '中埔鄉'),
(607, '嘉義縣', '大埔鄉'),
(608, '嘉義縣', '水上鄉'),
(611, '嘉義縣', '鹿草鄉'),
(612, '嘉義縣', '太保市'),
(613, '嘉義縣', '朴子市'),
(614, '嘉義縣', '東石鄉'),
(615, '嘉義縣', '六腳鄉'),
(616, '嘉義縣', '新港鄉'),
(621, '嘉義縣', '民雄鎮'),
(622, '嘉義縣', '大林鎮'),
(623, '嘉義縣', '溪口鄉'),
(624, '嘉義縣', '義竹鄉'),
(625, '嘉義縣', '布袋鎮'),
(630, '雲林縣', '斗南鎮'),
(631, '雲林縣', '大埤鄉'),
(632, '雲林縣', '虎尾鎮'),
(633, '雲林縣', '土庫鎮'),
(634, '雲林縣', '褒忠鄉'),
(635, '雲林縣', '東勢鄉'),
(636, '雲林縣', '臺西鄉'),
(637, '雲林縣', '崙背鄉'),
(638, '雲林縣', '麥寮鄉'),
(640, '雲林縣', '斗六市'),
(643, '雲林縣', '林內鄉'),
(646, '雲林縣', '古坑鄉'),
(647, '雲林縣', '莿桐鄉'),
(648, '雲林縣', '西螺鎮'),
(649, '雲林縣', '二崙鄉'),
(651, '雲林縣', '北港鎮'),
(652, '雲林縣', '水林鄉'),
(653, '雲林縣', '口湖鄉'),
(654, '雲林縣', '四湖鄉'),
(655, '雲林縣', '元長鄉'),
(700, '臺南市', '中西區'),
(701, '臺南市', '東區'),
(702, '臺南市', '南區'),
(704, '臺南市', '北區'),
(708, '臺南市', '安平區'),
(709, '臺南市', '安南區'),
(710, '臺南市', '永康區'),
(711, '臺南市', '歸仁區'),
(712, '臺南市', '新化區'),
(713, '臺南市', '左鎮區'),
(714, '臺南市', '玉井區'),
(715, '臺南市', '楠西區'),
(716, '臺南市', '楠化區'),
(717, '臺南市', '仁德區'),
(718, '臺南市', '關廟區'),
(719, '臺南市', '龍崎區'),
(720, '臺南市', '官田區'),
(721, '臺南市', '麻豆區'),
(722, '臺南市', '佳里區'),
(723, '臺南市', '西港區'),
(724, '臺南市', '七股區'),
(725, '臺南市', '將軍區'),
(726, '臺南市', '學甲區'),
(727, '臺南市', '北門區'),
(730, '臺南市', '新營區'),
(731, '臺南市', '後壁區'),
(732, '臺南市', '白河區'),
(733, '臺南市', '東山區'),
(734, '臺南市', '六甲區'),
(735, '臺南市', '下營區'),
(736, '臺南市', '柳營區'),
(737, '臺南市', '鹽水區'),
(741, '臺南市', '善化區'),
(742, '臺南市', '大內區'),
(743, '臺南市', '山上區'),
(744, '臺南市', '新市區'),
(745, '臺南市', '安定區'),
(749, '高雄市', '那瑪夏區'),
(800, '高雄市', '新興區'),
(801, '高雄市', '前金區'),
(802, '高雄市', '苓雅區'),
(803, '高雄市', '鹽埕區'),
(804, '高雄市', '鼓山區'),
(805, '高雄市', '旗津區'),
(806, '高雄市', '前鎮區'),
(807, '高雄市', '三民區'),
(811, '高雄市', '楠梓區'),
(812, '高雄市', '小港區'),
(813, '高雄市', '左營區'),
(814, '高雄市', '仁武區'),
(815, '高雄市', '大社區'),
(820, '高雄市', '岡山區'),
(821, '高雄市', '路竹區'),
(822, '高雄市', '阿蓮區'),
(823, '高雄市', '田寮區'),
(824, '高雄市', '燕巢區'),
(825, '高雄市', '橋頭區'),
(826, '高雄市', '梓官區'),
(827, '高雄市', '彌陀區'),
(829, '高雄市', '湖內區'),
(830, '高雄市', '鳳山區'),
(831, '高雄市', '大寮區'),
(832, '高雄市', '林園區'),
(833, '高雄市', '鳥松區'),
(838, '高雄市', '永安區'),
(840, '高雄市', '大樹區'),
(842, '高雄市', '旗山區'),
(843, '高雄市', '美濃區'),
(844, '高雄市', '六龜區'),
(845, '高雄市', '內門區'),
(846, '高雄市', '杉林區'),
(847, '高雄市', '甲仙區'),
(848, '高雄市', '桃源區'),
(851, '高雄市', '茂林區'),
(852, '高雄市', '茄萣區'),
(900, '屏東縣', '屏東市'),
(901, '屏東縣', '三地門鄉'),
(902, '屏東縣', '霧臺鄉'),
(903, '屏東縣', '瑪家鄉'),
(904, '屏東縣', '九如鄉'),
(905, '屏東縣', '里港鄉'),
(906, '屏東縣', '高樹鄉'),
(907, '屏東縣', '鹽埔鄉'),
(908, '屏東縣', '長治鄉'),
(909, '屏東縣', '麟洛鄉'),
(911, '屏東縣', '竹田鄉'),
(912, '屏東縣', '內埔鄉'),
(913, '屏東縣', '萬丹鄉'),
(920, '屏東縣', '潮州鎮'),
(921, '屏東縣', '泰武鄉'),
(922, '屏東縣', '來義鄉'),
(923, '屏東縣', '萬巒鄉'),
(924, '屏東縣', '崁頂鄉'),
(925, '屏東縣', '新埤鄉'),
(926, '屏東縣', '南州鄉'),
(927, '屏東縣', '林邊鄉'),
(928, '屏東縣', '東港鎮'),
(929, '屏東縣', '琉球鄉'),
(931, '屏東縣', '佳冬鄉'),
(932, '屏東縣', '新園鄉'),
(940, '屏東縣', '枋寮鄉'),
(941, '屏東縣', '枋山鄉'),
(942, '屏東縣', '春日鄉'),
(943, '屏東縣', '獅子鄉'),
(944, '屏東縣', '車城鄉'),
(945, '屏東縣', '牡丹鄉'),
(946, '屏東縣', '恆春鎮'),
(947, '屏東縣', '滿洲鄉'),
(950, '臺東縣', '臺東市'),
(951, '臺東縣', '綠島鄉'),
(952, '臺東縣', '蘭嶼鄉'),
(953, '臺東縣', '延平鄉'),
(954, '臺東縣', '卑南鄉'),
(955, '臺東縣', '鹿野鄉'),
(956, '臺東縣', '關山鎮'),
(957, '臺東縣', '海端鄉'),
(958, '臺東縣', '池上鄉'),
(959, '臺東縣', '東河鄉'),
(961, '臺東縣', '成功鎮'),
(962, '臺東縣', '長濱鄉'),
(963, '臺東縣', '太麻里鄉'),
(964, '臺東縣', '金峰鄉'),
(965, '臺東縣', '大武鄉'),
(966, '臺東縣', '達仁鄉'),
(970, '花蓮縣', '花蓮市'),
(971, '花蓮縣', '新城鄉'),
(972, '花蓮縣', '秀林鄉'),
(973, '花蓮縣', '吉安鄉'),
(974, '花蓮縣', '壽豐鄉'),
(975, '花蓮縣', '鳳林鎮'),
(976, '花蓮縣', '光復鄉'),
(977, '花蓮縣', '豐濱鄉'),
(978, '花蓮縣', '瑞穗鄉'),
(979, '花蓮縣', '萬榮鄉'),
(981, '花蓮縣', '玉里鎮'),
(982, '花蓮縣', '卓溪鄉'),
(983, '花蓮縣', '富里鄉'),
(30001, '新竹市', '北區'),
(30002, '新竹市', '東區'),
(30003, '新竹市', '香山區'),
(60001, '嘉義市', '東區'),
(60002, '嘉義市', '西區');

-- --------------------------------------------------------

--
-- 資料表結構 `ccats`
--

CREATE TABLE `ccats` (
  `num` int(11) NOT NULL,
  `c_name` varchar(20) NOT NULL,
  `e_name` varchar(20) NOT NULL,
  `size` varchar(20) NOT NULL,
  `age` varchar(20) NOT NULL,
  `disease` varchar(100) NOT NULL,
  `color` varchar(100) NOT NULL,
  `fur` varchar(20) NOT NULL,
  `personality` varchar(500) NOT NULL,
  `pic` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 資料表的匯出資料 `ccats`
--

INSERT INTO `ccats` (`num`, `c_name`, `e_name`, `size`, `age`, `disease`, `color`, `fur`, `personality`, `pic`) VALUES
(1, '  阿比西尼亞貓', '  Abyssinian', '  中', '  14~17+', '  丙酮酸激酶、漸進性視網膜萎縮症 、多發性硬化症、類風濕性關節炎', '  淡紅色、橘色、藍色、肉桂色或淺黃褐色', '  無', '  聰明、精力充沛、深情', 'picAbyssinian.jpg'),
(2, '美國短尾貓', 'American Bobtail', '中', '11~15+', '無', '各種顏色', '短毛', '隨和、深情、適應性強', 'pic\\American Bobtail.jpg'),
(3, '美國捲耳貓', 'American Curl', '中小', '10~20+', '無', '白色、藍色、紅色、奶油色、巧克力色、紫丁香色、銀色、金色、龜殼色、蛋糕奶油色、褐色', '無', '社交、愛玩、聰明', 'pic\\American Curl.jpg'),
(4, '美國短毛貓', 'American Shorthair', '中', '15+', '先天性心肌肥大、髖關節發育不良', '各種顏色，虎斑為常見色', '長毛', '隨和、友善、好奇', 'pic\\American Shorthair.jpg'),
(5, '美國硬毛貓', 'American Wirehair', '中大', '10~15+', '無', '各種顏色，虎斑為常見色', '無', '隨和、友善、好奇', 'pic\\American Wirehair.jpg'),
(6, '澳大利亞霧貓', 'Australian Mist', '中', '15+', '先天性心肌肥大', '藍色、啡色、巧克力色、金色、淡紫色、桃紅色', '無', '深情、溫柔、容易適應', 'pic\\Australian Mist.jpg'),
(7, '巴里貓', 'Balinese', '中', '10~20+', '對麻醉敏感', '銀白色、巧克力色、藍色、丁香色。', '無', '外向、好奇、深情', 'pic\\Balinese.jpg'),
(8, '孟加拉貓', 'Bengal', '中', '12~20', '丙酮酸激酶、漸進性視網膜萎縮症、先天性心肌肥大、白血病、腸胃敏感', '棕色虎斑、黑銀虎斑、雪豹、海豹紋虎斑、海豹水貂虎斑、銀雪', '無', '活躍、愛玩、聰明', 'pic\\Bengal.jpg'),
(9, '伯曼貓', 'Birman', '中大', '9~15+', '無', '海豹重點色', '無', '可愛、忠誠', 'pic\\Birman.jpg'),
(10, '孟買貓', 'Bombay', '中', '15~17+', '生物素酶缺乏症、 神經節苷脂儲積症、先天性心肌肥大、生物素酶缺乏症', '黑', '無', '可愛、聰明、親人', 'pic\\Bombay.jpg'),
(11, '英國短毛貓', ' British Shorthair', '中大', '12~20+', '先天性心肌肥大、牙齒部分疾病', '各種顏色，其中包括純色、銀影、煙色、斑紋、雙色等', '長毛', '冷靜、可愛、獨立', 'pic\\British Shorthair.jpg'),
(12, '緬因貓', 'Burmese', '中大', '12+', '先天性心肌肥大', '褐色、香檳色、藍色和鉑金', '無', '性情甜美、俏皮、親人', 'pic\\Burmese.jpg'),
(13, '波米拉貓', 'Burmilla', '中', '15~18+', '無', '閃亮的銀白色底色，帶有黑色、棕色、藍色、巧克力色、丁香色、焦糖色、米色和杏色', '無', '愛玩、深情、聰明', 'pic\\Burmilla.jpg'),
(14, '沙特爾貓', 'Chartreux', '中', '8~13+', '無', '藍灰', '無', '愛、忠誠、隨和', 'pic\\Chartreux.jpg'),
(15, '非洲獅子貓', 'Chausie', '中大', '12~18+', '無', '啡雜色斑點虎斑、黑色、銀色毛尖', '長毛、短毛', '忠誠、無畏、有愛心', 'pic\\Chausie.jpg'),
(16, '柯尼斯捲毛貓', 'Cornish Rex', '小', '9~13+', '皮膚病、先天性心肌肥大、髕骨脫位', '各種顏色', '無', '運動、甜美、忠誠', 'pic\\Cornish Rex.jpg'),
(17, '威爾斯貓', 'Cymric', '中', '16+', '無', '黑色、棕色、巧克力色、肉桂色、藍色、丁香色、小鹿色、紅色和奶油色', '長毛', '忠誠、創新、搞笑', 'pic\\Cymric.jpg'),
(18, '德文帝王貓', 'Devon Rex', '中', '14~17+', '德文氏肌病、先天性心肌肥大', '各種顏色', '無', '俏皮、活躍、黏人', 'pic\\Devon Rex.jpg'),
(19, '唐斯芬克斯貓', 'Donskoy', '中', '12~15+', '皮膚病', '橡膠禿 (Rubber Bald)、植絨 (Flock)、絲絨 (Velour) 和刷子 (Brush)', '無', '優雅、社交、溫柔', 'pic\\Donskoy.jpg'),
(20, '埃及貓', 'Egyptian Mau', '中', '10~15+', '丙酮酸激酶、腎結石、異染性腦白質退化症', '銀、銅和煙色、醋栗色眼睛', '無', '快速、忠誠、溫柔', 'pic\\Egyptian Mau.jpg'),
(21, '異國短毛貓', 'Exotic Shorthair', '中', '8~11+', '呼吸困難、面部皮膚發炎、多囊腎病、眼瞼發育不全、心臟病', '白色、紅色、奶油色、黑色、藍色、巧克力色、丁香色、銀色、金色、玳瑁色、藍色奶油色、棕色、印花布和海豹色', '無', '安靜、溫柔、甜蜜', 'pic\\Exotic Shorthair.jpg'),
(22, '哈瓦那棕貓', 'Havana', '中', '8~13+', '皮膚病', '桃花心木紅棕色、粉灰色、淡紫色', '無', '好玩、好奇、聰明', 'pic\\Havana.jpg');

-- --------------------------------------------------------

--
-- 資料表結構 `ddisease`
--

CREATE TABLE `ddisease` (
  `num` int(11) NOT NULL,
  `dname` varchar(50) NOT NULL,
  `dcause` varchar(500) NOT NULL,
  `dprevent` varchar(500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 資料表的匯出資料 `ddisease`
--

INSERT INTO `ddisease` (`num`, `dname`, `dcause`, `dprevent`) VALUES
(1, ' 狂犬病', '  貓也會罹患狂犬病，症狀和狗類似，狂躁期時貓會躲到隱匿處，兇猛攻擊靠近的人或其他動物靠。患貓的瞳孔會放大、弓背、伸爪、持續喵喵叫，叫聲逐漸沙啞。隨著疾病進展到麻痺期，行動會逐漸不協調，接著後軀麻痺，然後頭部肌肉麻痺，很快的就會昏迷死亡。', '  注射狂犬病預防疫苗，貓於三月齡以上時應注射第一劑狂犬病疫苗，以後每年定期補強注射一次。'),
(2, '貓泛白血球減少症', '又名貓瘟或貓小病毒，是一種急性高度接觸性傳染病，傳染途徑是接觸帶病毒的排泄物或吸血昆蟲及蚤類，也能藉由貓媽媽母傳子傳染給幼貓。症狀為突然發高燒、頑固性嘔吐、腹瀉、脱水、循環障礙及白細胞急劇減少。', '施打基本核心疫苗，幼貓從8～9週齡開始施打，接下來每3～4週補強，最後一劑疫苗落在16週齡以上（共三劑）。若是從未施打過的成貓，應施打兩劑核心疫苗，相隔3～4週。小時候打過疫苗、超過五年沒有補強的老貓，也需要補強一劑。'),
(3, '貓糖尿病', '貓大多罹患的是第二型糖尿病，也就是身體細胞對胰島素無反應，葡萄糖無法分解而堆積在血液中。症狀為三多「吃多、喝多、尿多」、活動力下降、嗜睡、體重減輕。糖尿病引發最危險的問題是酮酸中毒，酮酸中毒會出現的症狀包括食慾不振、虛弱、嗜睡、呼吸異常、脫水、嘔吐和腹瀉，嚴重者會死亡。', '「高碳水化合物、低蛋白質」飲食也是糖尿病的誘發因子之一，飼主應盡可能餵食高質量的罐裝、低碳水化合物或生食。另外適當增加運動量也可以減輕貓咪的高血糖症狀。'),
(4, '下泌尿道症候群', '貓下泌尿道疾病是一系列由於膀胱及尿道受刺激所造成臨床症狀的總稱，常見的原因包括自發性膀胱炎、尿結石、尿道栓子等。患貓年齡介於2～6歲，肥胖、飼養於室內、運動量少、以乾飼料為主食及壓力大均易發生。症狀為上廁所的次數增加、尿尿時長時間蹲坐、尿尿時會喵喵叫、滴尿、尿液呈紅色、常舔拭尿道口周圍或到處亂尿尿。', '1.增加水分攝取，貓咪每天每公斤體重需要喝水50~100㏄，確保有足夠的排尿量。2.適度控制體重。3.定時清潔貓砂盆，最好將貓砂盆擺放在安靜、通風良好的地方。4.盡量避免製造出讓貓咪感到壓力的環境。'),
(5, '慢性腎衰竭', '慢性腎衰竭是家貓死因第一名，初期徵兆不明顯，身體老化和體內水分不足為兩大主要原因。症狀包括喝多、尿多、食慾下降、體重減輕、精神不振、不正常掉毛等。', '1.增加水分攝取。2.控制飲食，貓年紀大時不宜攝取過多蛋白質，鈉的攝取也不宜過多，鉀攝取不足也可能導致慢性腎臟病。3.別讓貓咪吃到有毒物質，像是地板非無毒清潔劑或發霉飼料，都會造成腎臟損害。'),
(6, '貓免疫不全症候群', '俗稱貓愛滋，屬於病毒感染造成的免疫不全症，和人的愛滋病毒相似但不會傳染給人類，主要的傳染途徑是透過打架抓傷或咬傷時唾液傳播互相傳染，因此養在室內的家貓被感染機率較低。症狀為發燒、慢性齒齦炎及口腔炎、慢性下痢、體重減輕、消瘦等。', '室外貓感染免疫缺陷病毒的機率較高，所以不要讓貓外出就能降低感染機率；另外讓貓咪均衡飲食、降低環境壓力等也能提高免疫力，減少愛滋病發率。'),
(7, '甲狀腺亢進', '甲狀腺素分泌過多而引發多重器官機能失調的內分泌疾病，好發於熟齡或高齡貓。常見症狀為胃口爆增但體重減輕、活力過盛不睡覺、變得焦躁易怒或有攻擊行為、局部毛脫落無光澤、喝多尿多等。', '尚未研究出確切病因為何，飼主只能從貓的日常作息觀察有無異狀，高齡貓的健檢可加入檢查甲狀腺的項目。'),
(8, '貓病毒性鼻氣管炎', '由貓皰疹病毒引起的常見上呼吸道傳染病，傳染性極強，傳播途徑為受感染之唾液、飛沫、被沾染物品傳染。主要症狀為咳嗽、鼻塞、打噴嚏、發燒、流鼻涕、精神不濟、厭食、結膜炎等。', '1.施打核心疫苗。2.多貓家族需滿足每隻貓需要的資源和社交關係，避免壓力產生。3.飼主在外接觸其他貓，回家要洗手更衣，避免病原體傳染。4.高溫和高濕度會影響貓的免疫力，居家溫度宜設在28度以下、濕度控制在50％左右。'),
(9, '貓癬', '貓的真菌感染皮膚病，傳染力強，症狀是脫毛區域呈現不規則圓形，混合鱗狀斑點和結疤，有時還混著過敏性的丘疹，多發於貓咪的臉部、軀幹、四肢和尾部等處，也會傳染給人類。', '1.多接觸陽光可殺死黴菌，也可促進維生素D和鈣質的吸收，增強免疫力。2.維持環境消毒和清潔，減少引發貓癬的真菌孢子存活的機會。3.加強貓咪的營養增加抵抗力，補充維生素B群、omega-3脂肪酸和鋅等。'),
(10, '關節炎', '高齡貓咪老化出現的疾病，因跑跳、運動過度使用，或因體型、基因、過往舊傷等造成關節結構不穩定，經長時間累積與耗損所導致的關節發炎與壓迫疾病。症狀為貓咪活動力明顯降低、後肢無力、拖行走路、不願跳躍或負重、降低與人互動意願等。', '1.控制體重，過重是造成關節耗損的元兇。2.適量活動，日常運動可鍛鍊肌肉和韌帶，可多讓貓與玩具互動。3.在日常飲食添加葡萄糖胺等營養素，保養關節和軟骨，延後關節炎發生的情形。4.為老貓鋪設防滑墊，減少關節負擔。'),
(11, '胃炎', '貓咪胃黏膜發炎症簡稱為胃炎，引發胃炎的原因很多，可能是吃到不新鮮食物、吃東西速度過快、吃到會過敏的食物或細菌感染…等。嘔吐、打嗝、食慾不振、血便、腹瀉。', '限制飲食和飲水8～12小時，讓腸胃充分休息（幼貓幼犬貓禁食6小時）。一旦停止嘔吐，可提供少量的水；如果喝水過了幾小時後仍不見嘔吐，就可提供少量、易消化的食物（如罐頭），並以少量多餐的方式，讓毛孩就慢慢恢復腸胃功能。如果毛孩嘔吐持續12小時，務必馬上送醫，讓獸醫師進一步體檢及輸液治療。'),
(12, '腸道炎', '患病原因有飲食突然改變、吃到有毒物質、吃到會過敏的食物、細菌感染、寄生蟲感染或因腎臟病併發。腹瀉、食慾不振、嘔吐。', '減輕腸胃負擔，必要時可禁食一天。如果是急性腸炎要盡快到動物醫院就診處理，一般治療方式採抗菌消炎、緩瀉止瀉、強心補液，防止自體中毒。'),
(13, '皮膚過敏', '引發皮膚過敏的原因可能有食物過敏、跳蚤、花粉、螨及黴菌。不斷抓或啃咬患部、患部出現皮疹、患部掉毛。', '定期驅蟲、避免使用致敏或塑膠製品、補充營養品、選擇低敏配方的食物'),
(14, '結腸炎', '罹患結腸炎的原因很多，包括吃到變質食物、感染細菌、真菌、病毒、過敏和寄生蟲。至於為什麼會發展成便祕，這是因為結腸炎會造成貓咪排便困難（採排便姿勢，但大不出來），進而形成便祕情形。腹瀉、食慾不振、脫水、嘔吐、便祕。', '均衡的運動與飲食、貓食少量多餐為妙、配合乳酸菌酵母片、補充水分、給予溼食、補充適量水溶纖維質、舒適、乾淨的砂盆環境。'),
(15, '耳朵感染', '引起貓咪耳道感染的原因，包括蟎、細菌、真菌、糖尿病併發、過敏和反應用藥的副作用。耳朵有異味、耳朵流膿、常搖頭、耳瓣腫大、耳朵超敏感。', '貓咪耳朵在沒有異常的情況下，不會出現太多耳垢，如果貓咪耳朵 沒有耳垢或臭味，不需要每天點清耳液去清理，有時過度清理，反而容易造成耳朵發炎，因此如果只是日常保健，一個月清潔1-2次就可以了。'),
(16, '上呼吸道感染', '上呼吸道感染主要為貓皰疹病毒及貓卡里西病毒所引起。當家中有一隻貓咪罹患上呼吸道感染時，建議將生病的貓咪與健康貓咪暫時隔離，以免病毒在牠們之間傳染開來。鼻子和眼睛有分泌物、常打噴嚏、咳嗽、口腔或鼻腔潰瘍。', '接種疫苗，針對貓流感疫苗接種被認為是必需的疫苗。貓咪生活區域的清潔。定期洗它的食用碗和床上用品。這對於多貓家庭和室內外戶外貓特別重要。這些貓與更多的疾病接觸，感染風險較高。\n\n'),
(17, '心絲蟲', '一般心絲蟲的宿主多為狗，貓很少見，但是少見不等於不會感染。有些貓咪感染了心絲蟲後很少見明顯症狀，有些卻會咳嗽，呼吸困難，嘔吐。', '減少蚊蟲出現在貓咪的活動範圍，當貓咪有脫毛、相互舔舐的疑慮，可以使用方便餵食的口服錠劑，或是定期滴藥驅蟲。'),
(18, '跳蚤', '不停撓癢，脫毛，甚至皮膚上出現禿斑，或是貓咪毛上有黑沫。', '只要按時使用除跳蚤滴劑就可以解決了。不過千萬記得，不能因為省錢，把狗的跳蚤藥用在貓咪身上哦，犬用跳蚤藥有些成分對貓咪可是致命的！'),
(19, '傳染性腹膜炎', '發病情況以1～2歲的貓及老齡貓多發。純種貓多發於家貓。食慾減退或間斷性厭食。體溫升高39.7℃—41℃，7-40 天后可見有明顯的腹圍增大，隨着腹圍增大，可表現有呼吸困難、貧血、消瘦，病程數周后貓衰竭死亡。', '儘可能改善貓的生活環境，減少壓力，避免創傷，保持衛生整潔和舒適愉快。減少同時養貓數量。避免寄養、住院。'),
(20, '牙周病', '吃飯困難，口臭，咀嚼習慣改變（比如說以前咬的嘎嘣嘎嘣響，現在只吞不嚼），或是口臭味道很嚴重，牙齦變色，紅腫，口腔潰瘍，不能控制的流口水，或者不停的蹭嘴巴。', '定期刷牙，使用清潔牙齒的零食或者玩具。'),
(21, '肥胖', '若貓咪的體態不符合以下敘述，肋骨上有薄薄的脂肪，能夠摸到肋骨、能夠看出腰身、腹部有薄薄的脂肪層，但根據每個貓咪品種會有不一樣的指標，詳見世界小動物獸醫協會（WSAVA）發表的體態評估表。', '定期運動，吃的食物低脂低熱量，且須做食量控制，不能無限量供應食物給貓咪。'),
(22, '丙酮酸激酶', '隱性的遺傳疾病，會引起貧血，常見症狀有重度嗜睡、虛弱、運動障礙、黃疸、心臟雜音和脾腫大。', '主要預防方法是在配種前進行遺傳病篩查。若無法避免以上情形，就需避免過度運動、輸血治療、吸氧治療、切除擴大的脾臟、接受骨髓移植等。但無法痊癒。'),
(23, '多囊性腎病變', '多渴多尿、脫水、抑鬱、厭食、嘔吐、便秘、體重下降、肌肉消瘦、口腔潰瘍…等。多囊腎本身可能造成血尿並引發泌尿道感染。', '不讓患病的貓咪在做覽繁衍。並可以進行早期診斷，即超聲波診斷法和基因檢測法，這兩種方法的準確率都在90%以上。'),
(24, '先天性心肌肥大', '精神食慾下降、體重持續減輕、呼吸困難或頻率變快，再嚴重就會跛行、下半身癱瘓、後肢冰冷和疼痛不己的哀鳴。', '定期做檢查，獸醫有聽到心雜音或心律不整建議做深入的檢查。'),
(25, '多發性硬化症', '視力喪失、麻木感、無力、步履不穩、複視、疲倦、怕熱、癱瘓、脖子彎曲時引發觸電感等。以上這些症狀可能會消退，也可能長久持續，甚或逐漸加重，對漸進型的多發性硬化症患者，這些症狀會以緩慢的速度逐漸惡化。', '攝取足夠水分，飲食健康均衡。'),
(26, '漸進性視網膜萎縮症', '性格上的改變，譬如不願意上下樓梯或在黑暗走廊行走，這是夜盲症的特性，而在白天視力並無問題。隨著病情的發展，可以從眼睛的後方看到瞳孔擴張和反射光。但因失明的進展相當緩慢，較難察覺。', '要將此疾病及早發現避免配種散佈，貓隻於年輕配種前及早接受DNA之檢測，瞭解是否帶有PRA之突變基因後才決定配種與否。'),
(27, ' 神經節苷脂儲積症', '首先表現出頭部和骨盆肢體的震顫，然後發展為輕度到中度共濟失調，肢體失去平衡和協調，導致無法保持正常的姿勢和超出預期的肢體位置/運動(月經過多)。受影響的貓會間歇性跛行，無法站立，還會經歷視力損傷(如角膜混濁)，對聲音和觸摸等刺激會表現出誇張的驚嚇反應。肢體肌肉開始變得僵硬，沉重，難以移動，容易痙攣，隨著時間的推移，這種情況在全身變得普遍，在7到8個月大時變得嚴重。', '定期檢查，及早做治療。'),
(28, '髖關節發育不良', '走路時屁股會晃動得比較嚴重、跳躍力差、排泄不順暢、不喜歡被拍屁股', '定期檢查，及早做治療。'),
(29, '生物素酶缺乏症', '體重過輕、消瘦、憔悴、體態不佳、皮膚結痂、血便', '獲取生物素含量高的食物，或是購買補充劑放在食物中讓貓咪慢慢補充生物素。');

-- --------------------------------------------------------

--
-- 資料表結構 `hhospital`
--

CREATE TABLE `hhospital` (
  `num` int(11) NOT NULL,
  `hname` varchar(20) NOT NULL,
  `tel` varchar(20) NOT NULL,
  `city` int(11) NOT NULL,
  `address` varchar(50) NOT NULL,
  `special` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 資料表的匯出資料 `hhospital`
--

INSERT INTO `hhospital` (`num`, `hname`, `tel`, `city`, `address`, `special`) VALUES
(1, ' 大安動物醫院', '02-2363-2020', 100, '羅斯福路四段162號1樓', '24hr'),
(2, ' 慈愛動物醫院', '02-2556-3320', 103, '寧夏路1號', '24hr'),
(3, ' 全民動物醫院', '02-2553-0303', 103, '民生西路249號', '24hr'),
(4, ' 伊甸動物醫院', '02-8509-2579', 104, '北安路554巷33號', '24hr'),
(5, ' 太僕動物醫院', '02-2517-0902', 104, '龍江路260號', '24hr'),
(6, ' 隆記動物醫院', '02-2760-7639', 105, '民生東路五段212巷1號', '24hr'),
(7, ' 南京太僕動物醫院', '02-2756-2005', 105, '南京東路五段286號', '24hr'),
(8, ' 展望急診動物醫院', '02-2388-0122', 108, '中華路二段2號', '24hr'),
(9, ' 阿牛犬貓急診醫院', '02-2882-7381', 111, '基河路238號', '24hr'),
(10, ' 布達羊急診動物醫院', '02-2834-1119', 111, '忠誠路一段102號', '24hr'),
(11, ' 全民動物醫院', '02-2893-9752', 112, '懷德街6-3號', '24hr'),
(12, ' 全國動物醫院', '02-8791-8706', 114, '舊宗路一段30巷13號', '24hr'),
(13, ' 大群動物醫院', '02-2930-5557', 116, '羅斯福路六段206號', '24hr'),
(14, ' 來安動物醫院', '02-2211-8890', 231, '安康路二段115-1號', '24hr'),
(15, ' 中日動物醫院', '02-2226-3639', 235, '中山路三段2號', '24hr'),
(16, ' 亞東動物醫院', '02-2221-8515', 235, '中正路639號', '24hr'),
(17, ' 提姆沃克動物醫院', '02-8982-9291', 241, '中正北路23號', '24hr'),
(18, '翔心動物醫院', '02-2956-9099', 220, '忠孝路203號', '24hr'),
(19, ' 磨鼻子動物醫院', '03-453-5740', 320, '延平路20號', '24hr'),
(20, ' 元氣動物醫院', '03-333-3816', 330, '三民路三段381號', '24hr'),
(21, ' 品湛動物醫院', '03-336-3252', 330, '民生路495-9號', '24hr'),
(22, ' 元氣動物醫院', '03-355-3911', 330, '莊敬路一段156號', '24hr'),
(23, ' 全國動物醫院', '04-2371-0496', 403, '五權八街100號', '24hr'),
(24, ' 康德動物醫院', '04-2241-2700', 406, '崇德路二段270號', '24hr'),
(25, ' 台灣動物醫院', '04-2317-7069', 407, '青海路二段69號', '24hr'),
(26, ' 艾利動物醫院', '04-2258-9518', 408, '惠中路二段41號', '24hr'),
(27, ' 吉米哈利動物醫院', '04-2320-6910', 408, '大聖街250號', '24hr'),
(28, ' 毛公館動物醫院', '04-2380-9513', 408, '公益路二段685號', '24hr'),
(29, ' 慈愛動物醫院', '04-2406-6688', 412, '國光路二段539號', '24hr'),
(30, ' 成大動物醫院', '04-2639-8365', 436, '臨港路五段658巷27號', '24hr'),
(31, '格林威治動物醫院', '04-2320-2279', 408, '文心路一段486號', '24hr'),
(32, '中華動物醫院', '09-1113-7723', 436, '中山路503號', '24hr'),
(33, ' 快樂寵物醫院', '04-738-4978', 500, '彰南路二段180號', '24hr'),
(34, ' 全國動物醫院', '06-313-3116', 710, '中華路103號2樓', '24hr'),
(35, '慈愛動物醫院', '06-220-3166', 702, '西門路一段473號', '24hr'),
(36, ' 冠安動物醫院', '07-223-6451', 802, '中正二路131-1號', '24hr'),
(37, ' 宏力動物醫院', '07-310-2819', 807, '明誠一路326號', '24hr'),
(38, '聯盟動物醫院', '07-374-0964', 814, '鳳仁路231號', '24hr'),
(39, '烏鐸動物醫院', '07-722-0804', 802, '中正一路139號', '24hr'),
(40, '101台北貓醫院', '02-2509-1101', 104, '建國北路三段101號', '貓咪友善醫院'),
(41, '小小貓咪動物醫院', '02-2533-7529', 104, '北安路458巷47弄10號1樓', '貓咪友善醫院'),
(42, '杜瑪動物醫院', '02-2897-7779', 112, '大業路541號1樓', '貓咪友善醫院'),
(43, '流浪貓協會附設貓醫院', '02-2726-1872', 110, '信義路六段81號', '貓咪友善醫院'),
(44, '嘉慶動物醫院', '02-8787-9121', 105, '八德路四段218號', '貓咪友善醫院'),
(45, '貓醫生的貓診所', '02-2771-5810', 106, '忠孝東路三段194號2樓之1', '貓咪友善醫院'),
(46, '惟心動物醫院', '03-325-9001', 330, '大興路207號', '貓咪友善醫院'),
(47, '尼昂貓專科醫院', '04-2260-1470', 402, '復興路二段133號', '貓咪友善醫院'),
(48, '全國貓醫院', '04-2237-7025', 404, '進化北路162號', '貓咪友善醫院'),
(49, '吉米哈利動物醫院', '04-2320-6910', 408, '大聖街250號4樓', '貓咪友善醫院'),
(50, '喵屋貓咪專科醫院', '04-2328-3681', 408, '大墩17街125號', '貓咪友善醫院'),
(51, '崇愛動物醫院', '06-260-4733', 701, '崇明路463號', '貓咪友善醫院'),
(52, '勝立動物醫院', '06-222-8318', 700, '公園路84巷4號', '貓咪友善醫院'),
(53, '大毛小毛動物醫院', '07-780-9102', 807, '文濱路62號', '貓咪友善醫院'),
(54, '中興貓科醫療中心', '07-384-4631', 807, '大豐二路118-1號2樓', '貓咪友善醫院'),
(55, '遇見貓醫院', '07-522-2800', 804, '裕誠路2022號', '貓咪友善醫院'),
(56, '小王子貓專科醫院', '02-2706-1297', 106, '建國南路二段197號', '貓咪友善醫院'),
(57, '小米動物醫院', '03-316-4371', 330, '同安街383號', '貓咪友善醫院'),
(58, '築心動物醫院', '03-533-8055', 30002, '經國路一段654號', '貓咪友善醫院'),
(59, '高橋動物醫院', '03-835-8018', 970, '中正路91號', '貓咪友善醫院'),
(60, '勝立動物醫院', '06-222-8318', 700, '公園路84巷4號1樓', '貓咪友善醫院'),
(61, '波可動物醫院', '07-349-5560', 813, '自由四路367號', '貓咪友善醫院');

-- --------------------------------------------------------

--
-- 資料表結構 `uuser`
--

CREATE TABLE `uuser` (
  `num` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `pwd` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 資料表的匯出資料 `uuser`
--

INSERT INTO `uuser` (`num`, `name`, `pwd`) VALUES
(1, 'shao', '318'),
(2, 'a1093301', '1093301'),
(3, 'a1093302', '1093302'),
(4, 'a1093303', '1093303'),
(5, 'a1093304', '1093304'),
(6, 'a1093305', '1093305'),
(7, 'a1093306', '1093306'),
(8, 'a1093307', '1093307'),
(9, 'a1093308', '1093308'),
(10, 'a1093309', '1093309'),
(11, 'a1093310', '1093310'),
(12, 'a1093311', '1093311'),
(13, 'a1093312', '1093312'),
(14, 'a1093313', '1093313'),
(15, 'a1093314', '1093314'),
(16, 'a1093315', '1093315'),
(17, 'a1093316', '1093316'),
(18, 'a1093317', '1093317'),
(19, 'a1093318', '1093318'),
(20, 'a1093319', '1093319'),
(21, 'a1093320', '1093320'),
(22, 'a1093321', '1093321'),
(23, 'a1093322', '1093322'),
(24, 'a1093323', '1093323'),
(25, 'a1093324', '1093324');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `aarea`
--
ALTER TABLE `aarea`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `ccats`
--
ALTER TABLE `ccats`
  ADD PRIMARY KEY (`num`);

--
-- 資料表索引 `ddisease`
--
ALTER TABLE `ddisease`
  ADD PRIMARY KEY (`num`);

--
-- 資料表索引 `hhospital`
--
ALTER TABLE `hhospital`
  ADD PRIMARY KEY (`num`);

--
-- 資料表索引 `uuser`
--
ALTER TABLE `uuser`
  ADD PRIMARY KEY (`num`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
